/**
 * Задача №13
 * @description Описание задачи №13.
 * -- Описание задачи --
 * Сумма квадратов
 * Напишите функцию с именем squareSum, которая принимает массив чисел numbers
 * и возводит каждое число в квадрат и затем складывает
 * все полученные значения вместе.
 * Функция должна вернуть сумму квадратов всех чисел из массива.
 *
 *
 *
 *
 * - Аргументы
 * @param {any} input
 * @returns {any}
 *
 * -- Результат
 * @example squareSum([1, 2, 2])
 * @result 9
 *
 * @example squareSum([3, 3])
 * @result 18
 */
