/**
 * Задача №12
 * @description Описание задачи №12.
 * -- Описание задачи --
 * Отсортирован ли массив?
 * Реализуйте функцию inAscOrder(arr), которая принимает массив целых чисел. Нужно определить
 * расположены ли элементы массива в порядке возрастания.
 * Функция должна вернуть true, если элементы массива расположены в порядке возрастания, в
 * противном случае вернуть false.
 * Массивы, состоящие из 1 или 0 элементов, также должны возвращать true.
 *
 *
 *
 *
 * - Аргументы
 * @param {number[]} input
 * @returns {boolean}
 *
 * -- Результат
 * @example inAscOrder([1, 2, 4, 7, 19])
 * @result true
 *
 * @example inAscOrder([1, 2, 3, 4, 5]);
 * @result true
 *
 * @example inAscOrder([1, 6, 10, 18, 2, 4, 20]);
 * @result false
 *
 *
 */
