/**
 * Задача №8
 * @description Описание задачи №8.
 * -- Описание задачи --
 * Удаление элементов
 * Нужно написать функцию removeEverySecondOne(arr),
 * которая получает в качестве параметра массив и обрабатывает его,
 * удаляя каждый второй элемент массива.
 * Функция должна возвращать массив с удаленными элементами.
 *
 *
 *
 *
 * - Аргументы
 * @param {number[] || string[]} input
 * @returns {number[] || string[]}
 *
 * -- Результат
 * @example
 * removeEverySecondOne([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])
 * @result // [1, 3, 5, 7, 9]
 *
 * @example
 * removeEverySecondOne(["Оставить", "Убрать", "Оставить", "Убрать", "Оставить"])
 * @result // ["Оставить", "Оставить", "Оставить"]
 *
 *
 */
