/**
 * Задача №2
 * @description Описание задачи №2.
 * -- Описание задачи --
 * Расстояние Хэмминга
 * Расстояние Хэмминга — число позиций, в которых соответствующие
 * символы двух слов одинаковой длины различны.
 * Напишите функцию hammingDistance(str1, str2), принимающую на вход две строки одинаковой длины.
 * Функция должна возвращать число - расстояние Хэмминга.
 * Если строки имеют разную длину, то функция должна
 * возвращать: "Строки должны быть одинаковой длины".
 *
 *
 * - Аргументы
 * @param {string} str1 - Строка 1
 * @param {string} str2 - Строка 2
 * @returns {number} - Расстояние Хэмминга
 *
 * -- Результат
 * @example
 * hammingDistance('Hello', 'Hallo') // 1
 * @example
 * hammingDistance('Расстояние', 'Хэмминга') // Строки должны быть одинаковой длины
 * @example
 * hammingDistance('1010', '1111') // 2
 */
