/**
 * Задача №7
 * @description Описание задачи №7.
 * -- Описание задачи --
 *  Квадратный корень или квадрат?
 *
 * Нужно написать функцию squareOrSquareRoot(array),
 * которая будет получать целочисленный массив в качестве параметра и
 * обрабатывать каждое число из этого массива.
 * Если число является полным квадратом, извлеките его корень,
 * иначе возведите число в квадрат.
 * Функция должна вернуть новый массив, с обработанными числами полученного массива.
 *
 *
 * - Аргументы
 * @param {number[]} input
 * @returns {number[]}
 *
 * -- Результат
 * @example
 * squareOrSquareRoot([4, 3, 9, 7, 2, 1]) // [2, 9, 3, 49, 4, 1]
 * result
 */
