/**
 * Задача №9
 * @description Описание задачи №9.
 * -- Описание задачи --
 * Наибольшее и наименьшее
 * Нужно написать функцию highAndLow(numbers), которая будет получать
 * строку чисел numbers, разделенных пробелом. Ф
 * Функция должна вернуть строку с наибольшим и наименьшим числом из полученной строки.
 *
 *
 *
 *
 *
 *
 * - Аргументы
 * @param {string} input
 * @returns {string}
 *
 * -- Результат
 * @example
 * highAndLow("1 2 3 4 5");
 * @result "5 1"
 *
 * @example highAndLow("1 2 -3 4 5");
 * @result "5 -3"
 */
