/**
 * Задача №10
 * @description Описание задачи №10.
 * -- Описание задачи --
 *   Изограмма
 * Изограмма - это слово, в котором нет повторяющихся букв,
 * неважно последовательных или непоследовательных.
 *  Реализуйте функцию isIsogram(str), которая определяет, является ли строка передаваяемая str,
 * содержащая только буквы, изограммой.
 * Функция должна вернуть true, если строка является изограммой, в противном случае функция должна вернуть false.
 * Пусть пустая строка является изограммой. Алгоритм не должен обращать внимание на регистр букв.
 *
 * - Аргументы
 * @param {any} input
 * @returns {any}
 *
 * -- Результат
 * @example isIsogram("Dermatoglyphics")
 * @result // true
 *
 * @example isIsogram("aba")
 * @result // false
 *
 *
 * @example isIsogram("moOse")
 * @return // false
 *
 */
