/**
 * Задача №5
 * @description Описание задачи №5.
 * -- Описание задачи --
 * Нечетный отсев
 * Напишите функцию oddElimination(str), принимающую строку и выводящую один символ.
 * Функция удаляет из строки символы с нечетными индексами до тех пор, пока в строке не
 * останется только один символ.
 *
 * Пробел - это тоже символ.
 *
 *
 * - Аргументы
 * @param {string} str - Строка
 * @returns {string}
 *
 * -- Результат
 * @example
 * oddElimination('abcdef') // d
 * @example
 * oddElimination('hello world') // o
 * @example
 * oddElimination('123456789) // 8
 */
