/**
 * Задача №15
 * @description Описание задачи №15.
 * -- Описание задачи --
 * Пронумеровать строки
 * Напишите функцию number(array), которая принимает массив строк и возвращает
 * пронумерованные элементы этого массива.
 * Нумерация начинается с 1.
 * Формат n: string.
 * Обратите внимание на двоеточие и пробел между ними.
 *
 *
 *
 *
 * - Аргументы
 * @param {(number | string)[]} input
 * @returns {(number | string)[]}
 *
 * -- Результат
 * @example number([])
 * @result []
 *
 * @example number(["a", "b", "c")
 * @result ["1: a", "2: b", "3: c"]
 */
