/**
 * Задача №4
 * @description Описание задачи №4.
 * -- Описание задачи --
 *  Частый символ
 * Напишите функцию frequentSymbol(text), принимающую на вход текст, в котором нужно найти
 * самый часто используемый символ и вывести его.
 *
 * Если же в тексте одинаковое количество символов встречается одинаковое количество раз, то
 * функция будет выводить тот символ, который находится первым в тексте.
 * Строчная и прописная буква - это разные символы.
 *
 *
 *
 * - Аргументы
 * @param {string} text - Текст
 * @returns {string}
 *
 * -- Результат
 * @example
 * frequentSymbol('tic tac') // t
 * @example
 * frequentSymbol('Show Shawn Sharons shabby shoes') // h
 * @example
 * frequentSymbol('hello world') // l
 */
