/**
 * Задача №11
 * @description Описание задачи №11.
 * -- Описание задачи --
 *  Перемещение нулей в конец
 * Реализуйте функцию moveZeros(arr), которая принимает
 *  массив и перемещает все нули в конец, сохраняя порядок
 * расположения остальных элементов
 * Функция должна вернуть массив с нулями в конце.
 *
 *
 *
 *
 *
 *
 *
 * - Аргументы
 * @param {string[]} input [false, 1, 1, 2, 1, 3, "a", 0, 0]
 * @returns {string[]}
 *
 * -- Результат
 * @example moveZeros([false, 1, 0, 1, 2, 0, 1, 3, "a"])
 * @result [false, 1, 1, 2, 1, 3, "a", 0, 0]
 */
